
#     lui     x31, 0xDEADE      # 加载高 20 位
#     addi    x31, x31, 0xEEE    # 最终 x31 = 0xDEADBEEE (接近 DEADBEEF，方便识别)

#     # 2. 保存上下文 (至少保存你在 ISR 里会用到的寄存器)
#     addi    sp, sp, -16
#.    lw      x29,0(sp)
#.    lw      x30,4(sp)
#     sw      x10, 0(sp)
#     sw      x11, 4(sp)

#     # 3. 清楚中断源 (取决于你的中断控制器，如向某个地址写1)???
#     # 示例：向 0xe0000010 写入 0 表示处理完毕
#     lui     x10, 0xe0000
#     li      x11, 1
#     sw      x11, 16(x10)      # sw x11, 0x10(x10)

#     # 4. 仿真观测点：累加中断次数到内存地址 0xe0000008
#     lw      x11, 8(x10)       # 读取当前中断计数
#     addi    x11, x11, 1       # 计数加 1
#     sw      x11, 8(x10)       # 写回，仿真时监控该地址

#     # 5. 恢复上下文
#     lw      x10, 0(sp)
#     lw      x11, 4(sp)
#.    sw      x29,0(sp)
#.    sw      x30,4(sp)
#     addi    sp, sp, 16

#     # 6. 清除标记 (表示 ISR 即将退出)
#     li      x31, 0

#     # 7. 中断返回
#     mret